; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=297, out_folder=./training, instance_id=59, seed=2083, goal_proportion=0.03

(define (problem blocksworld-59)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 - object)
 (:init 
    (arm-empty)
    (clear b65)
    (on-table b65)
    (clear b207)
    (on-table b207)
    (clear b272)
    (on b272 b102)
    (on b102 b202)
    (on b202 b283)
    (on b283 b123)
    (on b123 b120)
    (on b120 b68)
    (on b68 b229)
    (on b229 b193)
    (on b193 b269)
    (on b269 b140)
    (on-table b140)
    (clear b21)
    (on b21 b152)
    (on b152 b156)
    (on-table b156)
    (clear b130)
    (on b130 b17)
    (on b17 b19)
    (on b19 b82)
    (on b82 b129)
    (on-table b129)
    (clear b59)
    (on b59 b118)
    (on b118 b2)
    (on-table b2)
    (clear b238)
    (on b238 b31)
    (on b31 b286)
    (on-table b286)
    (clear b255)
    (on b255 b292)
    (on b292 b245)
    (on b245 b280)
    (on b280 b241)
    (on-table b241)
    (clear b296)
    (on b296 b114)
    (on b114 b246)
    (on-table b246)
    (clear b33)
    (on b33 b247)
    (on b247 b153)
    (on b153 b143)
    (on b143 b266)
    (on b266 b208)
    (on b208 b22)
    (on-table b22)
    (clear b106)
    (on-table b106)
    (clear b252)
    (on b252 b209)
    (on b209 b112)
    (on b112 b180)
    (on b180 b110)
    (on-table b110)
    (clear b75)
    (on b75 b263)
    (on-table b263)
    (clear b38)
    (on-table b38)
    (clear b23)
    (on b23 b15)
    (on b15 b66)
    (on b66 b240)
    (on-table b240)
    (clear b196)
    (on b196 b145)
    (on-table b145)
    (clear b177)
    (on-table b177)
    (clear b270)
    (on b270 b148)
    (on b148 b169)
    (on b169 b57)
    (on b57 b108)
    (on b108 b166)
    (on b166 b277)
    (on b277 b199)
    (on b199 b249)
    (on b249 b295)
    (on b295 b45)
    (on b45 b219)
    (on b219 b212)
    (on b212 b276)
    (on b276 b284)
    (on b284 b24)
    (on-table b24)
    (clear b137)
    (on b137 b26)
    (on b26 b14)
    (on b14 b132)
    (on b132 b121)
    (on b121 b267)
    (on b267 b34)
    (on b34 b250)
    (on-table b250)
    (clear b192)
    (on b192 b5)
    (on b5 b159)
    (on-table b159)
    (clear b217)
    (on b217 b185)
    (on b185 b115)
    (on b115 b281)
    (on b281 b264)
    (on-table b264)
    (clear b18)
    (on b18 b1)
    (on-table b1)
    (clear b225)
    (on b225 b162)
    (on b162 b135)
    (on-table b135)
    (clear b144)
    (on b144 b289)
    (on b289 b69)
    (on b69 b154)
    (on b154 b60)
    (on b60 b258)
    (on b258 b230)
    (on b230 b176)
    (on b176 b282)
    (on b282 b76)
    (on b76 b260)
    (on b260 b157)
    (on-table b157)
    (clear b228)
    (on b228 b62)
    (on b62 b55)
    (on b55 b42)
    (on b42 b173)
    (on-table b173)
    (clear b221)
    (on-table b221)
    (clear b36)
    (on-table b36)
    (clear b293)
    (on-table b293)
    (clear b220)
    (on-table b220)
    (clear b73)
    (on b73 b234)
    (on b234 b41)
    (on-table b41)
    (clear b13)
    (on b13 b279)
    (on b279 b16)
    (on-table b16)
    (clear b71)
    (on-table b71)
    (clear b109)
    (on b109 b44)
    (on b44 b206)
    (on b206 b111)
    (on b111 b183)
    (on b183 b184)
    (on b184 b285)
    (on b285 b70)
    (on b70 b227)
    (on b227 b257)
    (on b257 b84)
    (on b84 b158)
    (on b158 b205)
    (on-table b205)
    (clear b6)
    (on-table b6)
    (clear b29)
    (on b29 b100)
    (on b100 b189)
    (on b189 b262)
    (on-table b262)
    (clear b122)
    (on b122 b131)
    (on b131 b172)
    (on b172 b222)
    (on b222 b161)
    (on b161 b190)
    (on-table b190)
    (clear b191)
    (on b191 b214)
    (on b214 b107)
    (on b107 b86)
    (on-table b86)
    (clear b194)
    (on b194 b47)
    (on-table b47)
    (clear b273)
    (on b273 b49)
    (on b49 b12)
    (on b12 b248)
    (on b248 b64)
    (on b64 b58)
    (on-table b58)
    (clear b235)
    (on b235 b243)
    (on b243 b287)
    (on b287 b117)
    (on b117 b27)
    (on-table b27)
    (clear b178)
    (on b178 b43)
    (on b43 b119)
    (on b119 b124)
    (on b124 b10)
    (on b10 b147)
    (on b147 b195)
    (on b195 b98)
    (on b98 b259)
    (on b259 b174)
    (on b174 b291)
    (on b291 b261)
    (on b261 b125)
    (on b125 b216)
    (on b216 b170)
    (on b170 b179)
    (on b179 b105)
    (on b105 b52)
    (on b52 b25)
    (on-table b25)
    (clear b201)
    (on b201 b268)
    (on b268 b95)
    (on b95 b186)
    (on b186 b265)
    (on-table b265)
    (clear b188)
    (on b188 b200)
    (on b200 b92)
    (on-table b92)
    (clear b256)
    (on b256 b165)
    (on b165 b46)
    (on b46 b231)
    (on b231 b32)
    (on b32 b72)
    (on b72 b77)
    (on b77 b101)
    (on b101 b242)
    (on b242 b50)
    (on b50 b99)
    (on-table b99)
    (clear b288)
    (on b288 b40)
    (on b40 b198)
    (on b198 b39)
    (on b39 b218)
    (on b218 b271)
    (on b271 b81)
    (on b81 b215)
    (on b215 b63)
    (on b63 b91)
    (on-table b91)
    (clear b8)
    (on b8 b175)
    (on b175 b203)
    (on b203 b204)
    (on b204 b35)
    (on b35 b167)
    (on b167 b138)
    (on b138 b97)
    (on b97 b3)
    (on-table b3)
    (clear b294)
    (on-table b294)
    (clear b48)
    (on b48 b30)
    (on b30 b197)
    (on b197 b297)
    (on b297 b233)
    (on-table b233)
    (clear b155)
    (on b155 b83)
    (on b83 b79)
    (on-table b79)
    (clear b151)
    (on b151 b96)
    (on b96 b133)
    (on b133 b150)
    (on b150 b51)
    (on-table b51)
    (clear b89)
    (on b89 b126)
    (on-table b126)
    (clear b171)
    (on b171 b128)
    (on b128 b11)
    (on b11 b53)
    (on b53 b90)
    (on b90 b136)
    (on b136 b187)
    (on-table b187)
    (clear b226)
    (on b226 b182)
    (on-table b182)
    (clear b85)
    (on b85 b56)
    (on b56 b113)
    (on b113 b149)
    (on-table b149)
    (clear b103)
    (on-table b103)
    (clear b54)
    (on b54 b181)
    (on b181 b211)
    (on b211 b116)
    (on-table b116)
    (clear b274)
    (on b274 b278)
    (on b278 b275)
    (on b275 b164)
    (on-table b164)
    (clear b78)
    (on b78 b146)
    (on b146 b160)
    (on b160 b67)
    (on b67 b239)
    (on b239 b74)
    (on b74 b224)
    (on b224 b87)
    (on b87 b244)
    (on-table b244)
    (clear b104)
    (on b104 b94)
    (on b94 b213)
    (on b213 b253)
    (on b253 b290)
    (on b290 b254)
    (on b254 b223)
    (on b223 b142)
    (on b142 b210)
    (on b210 b88)
    (on-table b88)
    (clear b4)
    (on-table b4)
    (clear b237)
    (on-table b237)
    (clear b236)
    (on b236 b127)
    (on b127 b163)
    (on b163 b37)
    (on b37 b251)
    (on b251 b20)
    (on-table b20)
    (clear b232)
    (on b232 b80)
    (on b80 b168)
    (on-table b168)
    (clear b93)
    (on b93 b28)
    (on b28 b134)
    (on b134 b139)
    (on b139 b141)
    (on b141 b7)
    (on b7 b61)
    (on-table b61)
    (clear b9)
    (on-table b9))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on-table b3)
    (clear b2)
    (on-table b2)
    (clear b5)
    (on b5 b6)
    (on-table b6)
    (clear b4)
    (on b4 b7)
    (on b7 b8)
    (on-table b8))))

; plan
1. (unstack b8 b175)
   deleted: (on b8 b175) (clear b8) (arm-empty)
   added: (holding b8) (clear b175)
   goals met: 4 of 12
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 12
3. (unstack b175 b203)
   deleted: (on b175 b203) (clear b175) (arm-empty)
   added: (holding b175) (clear b203)
   goals met: 5 of 12
4. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 5 of 12
5. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 6 of 12
6. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 6 of 12
7. (unstack b192 b5)
   deleted: (on b192 b5) (clear b192) (arm-empty)
   added: (holding b192) (clear b5)
   goals met: 7 of 12
8. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 7 of 12
9. (unstack b203 b204)
   deleted: (on b203 b204) (clear b203) (arm-empty)
   added: (holding b203) (clear b204)
   goals met: 7 of 12
10. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 7 of 12
11. (unstack b204 b35)
   deleted: (on b204 b35) (clear b204) (arm-empty)
   added: (holding b204) (clear b35)
   goals met: 7 of 12
12. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 7 of 12
13. (unstack b35 b167)
   deleted: (on b35 b167) (clear b35) (arm-empty)
   added: (holding b35) (clear b167)
   goals met: 7 of 12
14. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 7 of 12
15. (unstack b167 b138)
   deleted: (on b167 b138) (clear b167) (arm-empty)
   added: (holding b167) (clear b138)
   goals met: 7 of 12
16. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 7 of 12
17. (unstack b138 b97)
   deleted: (on b138 b97) (clear b138) (arm-empty)
   added: (holding b138) (clear b97)
   goals met: 7 of 12
18. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 7 of 12
19. (unstack b59 b118)
   deleted: (on b59 b118) (clear b59) (arm-empty)
   added: (holding b59) (clear b118)
   goals met: 7 of 12
20. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 7 of 12
21. (unstack b118 b2)
   deleted: (on b118 b2) (clear b118) (arm-empty)
   added: (holding b118) (clear b2)
   goals met: 8 of 12
22. (putdown b118)
   deleted: (holding b118)
   added: (clear b118) (arm-empty) (on-table b118)
   goals met: 8 of 12
23. (unstack b93 b28)
   deleted: (on b93 b28) (clear b93) (arm-empty)
   added: (holding b93) (clear b28)
   goals met: 8 of 12
24. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 8 of 12
25. (unstack b28 b134)
   deleted: (on b28 b134) (clear b28) (arm-empty)
   added: (holding b28) (clear b134)
   goals met: 8 of 12
26. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 8 of 12
27. (unstack b134 b139)
   deleted: (on b134 b139) (clear b134) (arm-empty)
   added: (holding b134) (clear b139)
   goals met: 8 of 12
28. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 8 of 12
29. (unstack b139 b141)
   deleted: (on b139 b141) (clear b139) (arm-empty)
   added: (holding b139) (clear b141)
   goals met: 8 of 12
30. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 8 of 12
31. (unstack b141 b7)
   deleted: (on b141 b7) (clear b141) (arm-empty)
   added: (holding b141) (clear b7)
   goals met: 8 of 12
32. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 8 of 12
33. (unstack b97 b3)
   deleted: (on b97 b3) (clear b97) (arm-empty)
   added: (holding b97) (clear b3)
   goals met: 8 of 12
34. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 8 of 12
35. (unstack b7 b61)
   deleted: (on b7 b61) (clear b7) (arm-empty)
   added: (holding b7) (clear b61)
   goals met: 8 of 12
36. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 9 of 12
37. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 12
38. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 10 of 12
39. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 12
40. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 11 of 12
41. (unstack b5 b159)
   deleted: (on b5 b159) (clear b5) (arm-empty)
   added: (holding b5) (clear b159)
   goals met: 10 of 12
42. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 12 of 12
